# Movie Recommendation System

1. Data Loading

In [1]:
#importing the necessary libraries/packages to start the project
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os

Here we have two datasets, which contains details about the movies, we will concatanate those two since we can create one dataset that contains all those details together.

In [2]:
# Load the dataset 
ratings_file = '/Users/anuththaradivyanjalie/Documents/SLIIT/IRWA/Group Assignment/BeginnerBugs_MovieRecommendation/new_dataset/ratings.csv'  # Update with your file path
movies_file = '/Users/anuththaradivyanjalie/Documents/SLIIT/IRWA/Group Assignment/BeginnerBugs_MovieRecommendation/new_dataset/movies.csv'    # Update with your file path

df_ratings = pd.read_csv(ratings_file)
df_movies = pd.read_csv(movies_file)

In [3]:
df_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
df_ratings.head()

   userId  movieId  rating   timestamp
0       1       16     4.0  1217897793
1       1       24     1.5  1217895807
2       1       32     4.0  1217896246
3       1       47     4.0  1217896556
4       1       50     4.0  1217896523

# 2. Analyzing and Preprocessing the Data

In [35]:
#to check the shape of the datasets, number of columns and rows
df_movies.shape

(10329, 3)

In [36]:
df_movies.duplicated().sum()

0

In [7]:
df_ratings.shape

(105344, 4)

In [37]:
df_ratings.duplicated().sum()

0

In [39]:
column_average = df_ratings['rating'].mean()
column_average

3.516825827764277

In [40]:
column_min = df_ratings['rating'].min()
column_min

0.5

In [42]:
column_max = df_ratings['rating'].max()
column_max

5.0

In the movies dataframe, movie title contains the year of the movie as well. Since we don't need that information we will be remove that part from the movie titel.

In [17]:
df_movies['title'] = df_movies['title'].str.replace(r'\(\d{4}\)', '', regex=True)

In [18]:
df_movies.head()

,movieId,title,genres
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji,Adventure|Children|Fantasy
2,3,Grumpier Old Men,Comedy|Romance
3,4,Waiting to Exhale,Comedy|Drama|Romance
4,5,Father of the Bride Part II,Comedy

As you can see in the 'genre' column, it separates the genres using '|', so will remove that as well.

In [19]:
# Combine genres into a single string
df_movies['genres'] = df_movies['genres'].str.replace('|', ' ')

In [20]:
df_movies.head()

,movieId,title,genres
0,1,Toy Story,Adventure Animation Children Comedy Fantasy
1,2,Jumanji,Adventure Children Fantasy
2,3,Grumpier Old Men,Comedy Romance
3,4,Waiting to Exhale,Comedy Drama Romance
4,5,Father of the Bride Part II,Comedy

In [21]:
# Merge the ratings and movies data
movie_data = pd.merge(df_ratings, df_movies, on='movieId') 

#merging had done on the basis of movieId

In [22]:
movie_data.head()

   userId  movieId  rating   timestamp    title       genres
0       1       16     4.0  1217897793  Casino   Crime Drama
1       9       16     4.0   842686699  Casino   Crime Drama
2      12       16     1.5  1144396284  Casino   Crime Drama
3      24       16     4.0   963468757  Casino   Crime Drama
4      29       16     3.0   836820223  Casino   Crime Drama

In [23]:
movie_data.shape

(105344, 6)

In [25]:
result= movie_data.dtypes
print(result)

userId         int64
movieId        int64
rating       float64
timestamp      int64
title         object
genres        object
dtype: object

For this recommendation engine we will not use the 'timestamp column' so we will be dropping it.

In [28]:
movie_data = movie_data.drop('timestamp', axis=1)

In [29]:
movie_data.head()

   userId  movieId  rating    title       genres
0       1       16     4.0  Casino   Crime Drama
1       9       16     4.0  Casino   Crime Drama
2      12       16     1.5  Casino   Crime Drama
3      24       16     4.0  Casino   Crime Drama
4      29       16     3.0  Casino   Crime Drama

In [30]:
#Check for missing values
movie_data.isnull().sum()

userId     0
movieId    0
rating     0
title      0
genres     0
dtype: int64

In [33]:
# Checking for duplicate values 
movie_data.duplicated().sum() 
# No duplicates

0